Added additional requirements and ux details
